{
  "model_type": "repo-jepa",
  "architectures": ["RepoJEPAModel"],
  "hidden_dim": 768,
  "num_encoder_layers": 12,
  "num_attention_heads": 12,
  "intermediate_dim": 3072,
  "hidden_dropout_prob": 0.1,
  "attention_dropout_prob": 0.1,
  "vocab_size": 50265,
  "max_seq_len": 512,
  "pad_token_id": 1,
  "base_model": "microsoft/codebert-base",
  "auto_map": {
    "AutoConfig": "modeling_repo_jepa.RepoJEPAConfig",
    "AutoModel": "modeling_repo_jepa.RepoJEPAModel"
  }
}
